bread-baker-notes/app/controllers/breads_controller.rb

SELECT "breads".* FROM "breads"
---
  def index
    @breads = Bread.all

INSERT INTO "breads" ("created_at", "date", "name", "preferment", "rating", "room_temp", "updated_at", "water_temp") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bread = Bread.new(bread_params)

    respond_to do |format|
      if @bread.save

SELECT "breads".* FROM "breads" WHERE "breads"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_bread
      @bread = Bread.find(params[:id])